GREETING_MESSAGE = (
    "Привет, {username}!\n"
    "Я бот для получения информации о свадьбе Гриши и Лены!\n"
    "Для получения общей информации воспользуйтесь командой /info\n"
    "Попробуйте все команды, не стесняйтесь!\n"
)

INFO_MESSAGE = (
    "Стиль такой-то\n"
    "Без детей\n"
    "Не дарите скороварки, мы живем за границей - не увезем!\n"
    "Сбор там-то\n"
    "Телефоны организаторов: ____"
    "И другая инфа!"
)

WEATHER_MESSAGE = (
    "Сейчас погода в Оленьих прудах:"
    "\nТемпература: {temperature}\nОписание: {description}"
)

DAYS_LEFT_MESSAGE = (
    "До знаменательной даты осталось {days_count} {days_word}!!!\n"
    "Еще чуть-чуть и вы сможете поплакать над тем, "
    "какие Гриша и Лена милые 🥰🥰🥰\n"
    "Ну и отдохнуть и повеселиться от души 🍾🍾🍾\n"
)

FALLBACK_MESSAGE = (
    'Для получения информации о свадьбе Гриши и Лены '
    'воспользуйтесь встроенными командами!\n'
)

STICKER_DOG = (
    "CAACAgIAAxkBAAELIitlnrqebILw4fRZ1TxmDvhm6SFo6AACfwEAAj0N6AS98XKpqDIlKDQE"
)
