GREETING_MESSAGE = (
    "Привет, {username}!\n"
    "Я бот для получения информации о свадьбе Гриши и Лены!\n"
    "Для получения общей информации воспользуйтесь командой /info\n"
    "Попробуйте все команды, не стесняйтесь!\n"
)

INFO_MESSAGE = (
    "Дорогие друзья! Мы с нетерпением ждем вашего присутствия "
    "на дне празднования нашего бракосочетания 24.08.24!\n"
    "🍾🍾🍾\n"
    "Мы предлагаем вам подготовиться к этому событию, следуя "
    "нескольким рекомендациям:\n\n"
    "👗 Стиль одежды: черные и бежевые тона. Вы можете найти "
    "вдохновение нашими  идеями на Pinterest.\n\n"
    "🚸 Беззаботное веселье: Мы решили провести свадьбу без детей, чтобы все "
    "гости могли насладиться мероприятием в полной мере.\n\n"
    "🤝 Помощь организаторов: Для вашего удобства нам помогут организаторы - "
    "Агата и Полина.\n"
    "Контакт Полины @polinadreizina.\n"
    "Контакт Агаты: @agatadreizina\n"
    "Они ответят на все вопросы и поделятся необходимой информацией "
    "о мероприятии.\n\n"
    "🌍 Напоминаем, что мы проживаем за границей, поэтому при выборе подарка "
    "рекомендуем ориентироваться на легкость перевозки. "
    "Например, 'скороварку' мы, к сожалению, не сможем взять с собой. "
    "Но ваша любовь и радость от вашего "
    "присутствия для нас самые ценные подарки! 🎁\n"
)

WEATHER_MESSAGE = (
    "Сейчас погода в Оленьих прудах:"
    "\nТемпература: {temperature}\nОписание: {description}"
)

DAYS_LEFT_MESSAGE = (
    "До знаменательной даты осталось {days_count} {days_word}!!!\n"
    "Еще чуть-чуть и вы сможете поплакать над тем, "
    "какие Гриша и Лена милые 🥰🥰🥰\n"
    "Ну и отдохнуть и повеселиться от души 🍾🍾🍾\n"
)

FALLBACK_MESSAGE = (
    'Для получения информации о свадьбе Гриши и Лены '
    'воспользуйтесь встроенными командами!\n'
)

STICKER_DOG = (
    "CAACAgIAAxkBAAELIitlnrqebILw4fRZ1TxmDvhm6SFo6AACfwEAAj0N6AS98XKpqDIlKDQE"
)
